[
  {
    "year": 1989,
    "headline": "Tiananmen Square massacre",
    "news_date": "China, June 1989",
    "content": "The Tiananmen Square protests were a series of student-led demonstrations in Beijing in 1989.  These protests were forcibly suppressed by government troops with assault rifles and tanks, killing several hundred demonstrators trying to block the military's advance towards Tiananmen Square after the government declared martial law.  These protests reflected anxieties about the country's future including inflation and restrictions on political participation. At the height of the protests, a million people assembled in the Square.",
    "source": "https://en.wikipedia.org/wiki/Tiananmen_Square_protests_of_1989",
    "source_name": "Wikipedia"
  },
  {
    "year": 1990,
    "headline": "Gulf War",
    "news_date": "Middle East, August 1990",
    "content": "The Gulf War was codenamed Operation Desert Shield and Operation Desert Storm. In its combat phase, the Gulf War was waged by coalition forces from 34 nations led by the United States against Iraq in response to Iraq's invasion and annexation of Kuwait.  The occupation was met with international condemnation and brought immediate economic sanctions against Iraq by members of the UN security Council. The U.S-led coalition was the largest military alliance since World War II with the majority of contributions from the US, Saudi Arabia, the UK, and Egypt.",
    "source": "https://en.wikipedia.org/wiki/Gulf_War",
    "source_name": "Wikipedia"
  },
  {
    "year": 1991,
    "headline": "Ethiopian Civil War",
    "news_date": "Ethiopia, years 1974 - 1991",
    "content": "The Ethiopian Civil War began with a coup staged against Emperor Haile.  The civil war lasted until the Ethiopian People's Revolutionary Democratic Front, a coalition of rebels, eventually overthrew the government in 1991. The urban guerrilla chapter of this war, called the Ethiopian Red Terror, created problems for the government as they had to battle guerrillas fighting for Eritrean independence during this entire period. At the end of this period, the war left around 1.4 million dead.",
    "source": "https://en.wikipedia.org/wiki/Ethiopian_Civil_War",
    "source_name": "Wikipedia"
  },
  {
    "year": 1992,
    "headline": "Bosnian War",
    "news_date": "Bosnia and Herzegovina, April 1992",
    "content": "The Bosnian War was an international armed conflict that took place in Bosnia and Herzegovina between 1992 and 1995.  This war was part of the breakup of Yugoslavia following the Slovenian and Croatian secessions. Bosnia & Herzegovina was mainly inhabited by Muslim Bosniaks and Orthodox Serbs who passed a referendum for independence, but this was rejected by the representatives of the Bosnian Serbs. The Serbs initially had superior weapons due to the JNA, but the creation of the Federation of Bosnia & Herzegovina following the Washington Agreement would eventually give them the upper hand.",
    "source": "https://en.wikipedia.org/wiki/Bosnian_War",
    "source_name": "Wikipedia"
  },
  {
    "year": 1993,
    "headline": "Bombay Riots",
    "news_date": "India, years 1992 - 1993",
    "content": "The Bombay Riots refer to the riots in Mumbia from December 1992 to January 1993 during which around 900 people died. These riots were mainly due to escalation of hostilities after large scale protests by Muslims in reaction to the 1992 Babri Masjid Demolition. Historians have stated that these riots were anti-Muslim pogrom and were followed by retaliatory bombings perpetrated by criminal groups with alleged help from a local ganglord Dawood Ibrahim and his D-Company syndicate (more than 300 people were killed).",
    "source": "https://en.wikipedia.org/wiki/Bombay_riots",
    "source_name": "Wikipedia"
  },
  {
    "year": 1994,
    "headline": "Rwandan Genocide",
    "news_date": "Rwanda, April 1994 - July 1994",
    "content": "The Rwandan genocide is officially known as the genocide against the Tutsi by the members of the Hutu majority government. Several hundred thousand Rwandans were killed during this 100 day period, the 70% of which being Tutsi—-overall 20% of the entire population of Rwanda. The genocide and slaughter finally ended when the Rwandan Patriotic Front led by Paul Kagame took control of the country. From this, an estimated 2 million Rwandans, mostly Hutus, were displaced and became refugees.",
    "source": "https://en.wikipedia.org/wiki/Rwandan_genocide",
    "source_name": "Wikipedia"
  },
  {
    "year": 1995,
    "headline": "First Chechen War",
    "news_date": "Chechnya, December 1994 - August 1996",
    "content": "The First Chechen War was also known as the War in Chechnya, which was a conflict between the Russian Federation and the Chechen Republic of Ichkeria. Russian federal forces attempted to seize control of Chechnya but were set back by Chechen guerrilla warfare and raids despite Russia's overwhelming manpower and air support. The resulting widespread demoralization of federal forces and the opposition of the Russian public to the conflict led the government to declare a ceasefire with the Chechens in 1996 and sign a peace treaty a year later.",
    "source": "https://en.wikipedia.org/wiki/First_Chechen_War",
    "source_name": "Wikipedia"
  },
  {
    "year": 1996,
    "headline": "First Congo War",
    "news_date": "Democratic Republic of Congo, year 1996",
    "content": "The First Congo War was a foreign invasion of Zaire led by Rwanda that ended up replacing the dictator with a rebel leader.  Destabilization in eastern Zaire following the Rwandan Genocide was the tipping point that caused factors to align against the corrupt and inept government in Kinshasa. The new government renamed the country to the Democratic Republic of the Congo, but this did little to bring about actual change. To avert a coup, the rebel leader expelled all Rwandan and Ugandan forces from the Congo.",
    "source": "https://en.wikipedia.org/wiki/First_Congo_War",
    "source_name": "Wikipedia"
  },
  {
    "year": 1997,
    "headline": "Albanian civil war",
    "news_date": "Albania, January 1997",
    "content": "The Albanian civil war was a period of anarchy, civil disorder, and violence in Albania sparked by Ponzi scheme failures. The Albanian citizens had lost a total of $1.2 billion despite the population being only 3 million total and took their protests to the streets. All major population centers were engulfed in demonstrations by March and foreign countries began to evacuate their citizens. The UN Security Council authorized a force of 7000 to direct relief efforts and restore order in Albania following concerns that the unrest would spread throughout Europe.",
    "source": "https://en.wikipedia.org/wiki/Albanian_civil_war_of_1997",
    "source_name": "Wikipedia"
  },
  {
    "year": 1998,
    "headline": "Kosovo War",
    "news_date": "Kosovo, February 1998",
    "content": "The Kosovo War was an armed conflict fought by the forces of the Federal Republic of Yugoslavia, which controlled Kosovo before the war, and the Kosovo Albanian rebel group known as the Kosovo Liberation Army with air support from NATO and ground support from the Albanian army. The KLA launched attacks targeting Serbian law enforcement and claimed responsibility for sabotage targeting police stations as well. The war ended with the Kumanovo Treaty, and Yugoslav and Serb forces withdrew from Kosovo to make way for international presence.",
    "source": "https://en.wikipedia.org/wiki/Kosovo_War",
    "source_name": "Wikipedia"
  },
  {
    "year": 1999,
    "headline": "Second Congo War",
    "news_date": "Congo, years 1998-2002",
    "content": "The Second Congo War, also named the Great War of Africa and the African World War, began in August 1998 and officially ended in 2003. The war is known to be the single most deadly war in African history, involving nine African countries and around 20 seperate armed groups. By 2008, the war and its aftermath had contributed to around 5.4 million deaths (mostly through disease and starvation) and around 2 million displaced from their homes. The war was driven by the trade in conflict minerals and political reasons.",
    "source": "https://en.wikipedia.org/wiki/Kargil_War",
    "source_name": "Wikipedia"
  },
  {
    "year": 2000,
    "headline": "Cochabamba Water War",
    "news_date": "Bolivia, years 1999 - 2000",
    "content": "The Cochabamba Water War was a series of protests that took place in Bolivia's largest city in response to the privatization of the city's municipal water supply company, Semapa. The wave of demonstrations and police violence was described as a public uprising against water prices. The tensions erupted when a new firm was required to invest in construction of a long-envisioned dam and dramatically raised water rates. Protests culminating in tens of thousands marching downtown and battling police.",
    "source": "https://en.wikipedia.org/wiki/Cochabamba_Water_War",
    "source_name": "Wikipedia"
  },
  {
    "year": 2001,
    "headline": "Insurgency in the Republic of Macedonia",
    "news_date": "2001 insurgency",
    "content": "The 2001 insurgency in the Republic of Macedonia was an armed conflict that began when the ethnic Albanian National Liberation Army militant group began attacking the security forces of the REpublic of Macedonia at the beginning of February 2001 and ended with the Ohrid Agreement. The goal of the NLA was to separate Republic of Macedonia and make Greater Albania.  The Albanian refugees from Kosovo in Macedonia actually accounts for over 10% of the total population of Macedonia at the time.",
    "source": "https://en.wikipedia.org/wiki/2001_insurgency_in_the_Republic_of_Macedonia",
    "source_name": "Wikipedia"
  },
  {
    "year": 2002,
    "headline": "Operation Defensive Shield",
    "news_date": "West Bank 2002",
    "content": "Operation Defensive Shield was the large-scale military operation conducted by the Israel Defensive Forces in 2002 during the course of the Second Intifada. It was the largest military operation in the West Bank since the 1967 Six-Day War. The stated goal of the operation was to stop terrorist attacks--the spark that gave rise to the action was the suicide bombing during Passover Seder at the Park Hotel in the Israeli resort city of Netanya in which a Palestinian suicide bomber killed 30 elderly vacationers.",
    "source": "https://en.wikipedia.org/wiki/Operation_Defensive_Shield",
    "source_name": "Wikipedia"
  },
  {
    "year": 2003,
    "headline": "War in Darfur",
    "news_date": "Sudan, years 2003 - present",
    "content": "The War in Darfur is a major armed conflict in the Darfur region of Sudan that began in February 2003 when the Sudan Liberation Movement and Justice and Equality Movement rebel groups began fighting the government of Sudan, which they accused of oppressing Darfur's non-Arab population. The government responded to attacks by carrying out a campaign of ethnic cleansing against Darfur's non-Arabs, which resulted in the deaths of hundreds of thousands of civilians and the indictment of Sudan's president for genocide, war crimes, and crimes against humanity.",
    "source": "https://en.wikipedia.org/wiki/War_in_Darfur",
    "source_name": "Wikipedia"
  },
  {
    "year": 2004,
    "headline": "First Battle of Fallujah",
    "news_date": "Iraq, year 2004",
    "content": "The First Battle of Fallujah, also known as Operation Vigilant Resolve, was an operation to root out extremist elements of Fallujah as well as an attempt to apprehend the perpetrators of the killing of 4 US contractors in April 2004. The chief catalyst for this operation was the highly publicized killing of 4 Blackwater US private military contractors and 5 American soldiers a few days earlier. This battle really polarized public opinion within Iraq regarding US involvement in the war.",
    "source": "https://en.wikipedia.org/wiki/First_Battle_of_Fallujah",
    "source_name": "Wikipedia"
  },
  {
    "year": 2005,
    "headline": "Haditha Massacre",
    "news_date": "Iraq, November 2005",
    "content": "The Haditha massacre refers to the November 2005 incident in which a group of United States Marines killed a group of unarmed Iraqi civilians.  It was alleged that these killings were retribution for the attack on a convoy of Marines with an improvised explosive device that killed a Lance Corporal. The initial Marine Corps report claimed that civilians were killed by a bomb blast but a reporter's questions prompted an in depth investigation by the United States military into the incident.",
    "source": "https://en.wikipedia.org/wiki/Haditha_massacre",
    "source_name": "Wikipedia"
  },
  {
    "year": 2006,
    "headline": "Operation Summer Rains",
    "news_date": "Gaza Strip, June - November 2006",
    "content": "Operation Summer Rains refers to a series of battles between Palestinian militants and the Israel Defense Forces during the summer of 2006, prompted by Palestinian operations that resulted in the capture of an Israeli soldier. Large-scale conventional warfare began in the Gaza Strip and it was the first major ground operation since Israel's unilateral disengagement plan was implemented in 2005. The stated goals of this operation was to suppress the firing of Qassam rockets from Gaza into western Negev and secure the release of their corporal.",
    "source": "https://en.wikipedia.org/wiki/Operation_Summer_Rains",
    "source_name": "Wikipedia"
  },
  {
    "year": 2007,
    "headline": "War in Somalia",
    "news_date": "Somalia, December 2006 - 2009",
    "content": "The War in Somalia was an armed conflict involving largely Ethiopian and Somali Transitional Federal Government forces and Somali troops from Puntland versus the Somali Islamist umbrella group for control of the country. The war officially began shortly before the US backed Ethiopian troops invaded Somalia to prop up the Somali TFG in Baidoa. The TFG then invited Ethiopians to intervene, which was an extremely unpopular decision, and resulted in a statement from Ethiopia that said it would actively combat the Islamic Court Union.",
    "source": "https://en.wikipedia.org/wiki/War_in_Somalia_(2006%E2%80%9309)",
    "source_name": "Wikipedia"
  },
  {
    "year": 2008,
    "headline": "Russo-Georgian War",
    "news_date": "Georgia, August 2008",
    "content": "The Russo-Georgian War was a war between Georgia, Russia, and the Russian backed self-proclaimed republics of South Ossetia and Abkhazia. The war took place in August of 2008 following a period of worsening relations between Russia and Georgia. The fighting took place in a very strategically important region that borders the Middle East and was regarded as the first European war of the 21st century. The war displaced almost 200,000 people and resulted in increased Russian military presence in Abkhazia and South Ossetia in violation of a ceasefire agreement.",
    "source": "https://en.wikipedia.org/wiki/Russo-Georgian_War",
    "source_name": "Wikipedia"
  },
  {
    "year": 2009,
    "headline": "Boko Haram insurgency",
    "news_date": "Nigeria, year 2009",
    "content": "The Boko Haram insurgency began when the jihadist rebel group Boko Haram started an armed rebellion against the government of Nigeria. In 2012, tensions within Boko Haram resulted in gradual split of the group between the Salafist conservative faction and the more dominant, violent faction. The insurgency spread to neighboring Cameroon, Chad, and Niger, which meant that it became a major regional conflict. This insurgency took place within the context of long-standing issues of religious violence between Nigeria's Muslim and Christian communities.",
    "source": "https://en.wikipedia.org/wiki/Boko_Haram_insurgency",
    "source_name": "Wikipedia"
  },
  {
    "year": 2010,
    "headline": "Kyrgyz Revolution",
    "news_date": "Kyrgyzstan, April 2010 - December 2010",
    "content": "The Kyrgyz Revolution of 2010, also known as the Second Kyrgyz Revolution began in April 2010with the ousting of the Kyrgyz president. It was followed by increased ethnic tension involving the Kyrgyz people and Uzbeks in the south of the country, which escalated in June 2010. The violence ultimately led to the consolidation of a new parliamentary system in Kyrgyzstan. During the general mayhem, exiles from the Uzbek minority claim they were assaulted and driven away, with almost 400,000 citizens becoming internally displaced. ",
    "source": "https://en.wikipedia.org/wiki/Kyrgyz_Revolution_of_2010",
    "source_name": "Wikipedia"
  },
  {
    "year": 2011,
    "headline": "Libyan Civil War",
    "news_date": "Libya, February 2011 - October 2011",
    "content": "The first Libyan Civil War, also referred to as the Libyan Revolution, was an armed conflict in Libya fought between forces loyal to Colonel Muammar Gaddafi and those seeking to oust his government. The war was preceded by protests in Zawiya and was finally ignited by protests in Benghazi, which led to clashes with security forces that fired on the crowd. The protests escalated into a rebellion that spread across the country, with forces opposing Gaddafi establishing an interim governing body, the National Transitional Council.",
    "source": "https://en.wikipedia.org/wiki/Libyan_Civil_War_(2011)",
    "source_name": "Wikipedia"
  },
  {
    "year": 2012,
    "headline": "al-Midan bombing",
    "news_date": "Syria, January 2012",
    "content": "This was the second such bombing since an uprising against the government that began in early 2011. Two weeks earlier, a double car bombing in Damascus killed 44 people and the government blamed both attacks on al Qaeda. According to the Syrian government a suicide bomber attacked buses carrying riot police shortly before an anti-government protest was to begin. However, Syrian opposition accused government of staging the attacks to justify its crackdown on the uprising but a newly formed Al-Nusra Front to Protect the Levant claimed responsibility.",
    "source": "https://en.wikipedia.org/wiki/January_2012_al-Midan_bombing",
    "source_name": "Wikipedia"
  },
  {
    "year": 2013,
    "headline": "Euromaiden",
    "news_date": "Ukraine, 2013 - 2014",
    "content": "Euromaiden was a wave of demonstrations and civil unrest in Ukraine, demanding closer European integration. The scope of the protests expanded, with many calls fro the resignation of the president and his government, and led to the Ukrainian revolution. Protesters then gained control of the presidential administration and parliament removed Yanukovych from office and replaced the government with a pro-European one.",
    "source": "https://en.wikipedia.org/wiki/Euromaidan",
    "source_name": "Wikipedia"
  },
  {
    "year": 2014,
    "headline": "War in Donbass",
    "news_date": "Ukraine, April 2014",
    "content": "The War in Donbass is an armed conflict in the Donbass region of Ukraine. Protests by pro-Russian and anti-government groups took place in Ukraine in the aftermath of the Ukrainian revolution and the Euromaiden movement. These demonstrations followed the annexation of Crimea by the Russian Federation, and which were a part of a wider group of protests across southern and eastern Ukraine. Prior to the change of leadership in August 2014, the separatists were largely led by Russian citizens.",
    "source": "https://en.wikipedia.org/wiki/War_in_Donbass",
    "source_name": "Wikipedia"
  },
  {
    "year": 2015,
    "headline": "Yemeni Civil War",
    "news_date": "Yemen, March 2015",
    "content": "The Yemeni Civil War is an ongoing conflict between two factions claiming to constitute the Yemeni government, along with their supporters and allies. Houthi forces controlling the capital and allied with forces loyal to the former president clashed with forces loyal to the government of Abdrabbuh Mansur Hadi based in Aden. Al-Qaeda in the Arabian Peninsula and the Islamic state of Iraq and the Levant have also carried out attacks, with AQAP controlling swaths of territory in the hinterlands as well as stretches of the coast.",
    "source": "https://en.wikipedia.org/wiki/Yemeni_Civil_War_(2015%E2%80%93present)",
    "source_name": "Wikipedia"
  }
]